"""РЕКУРСИЯ"""
"""
Задание 1.	Написать программу, которая будет складывать, вычитать,
умножать или делить два числа. Числа и знак операции вводятся пользователем.
После выполнения вычисления программа не должна завершаться, а должна
запрашивать новые данные для вычислений. Завершение программы должно
выполняться при вводе символа '0' в качестве знака операции. Если пользователь
вводит неверный знак (не '0', '+', '-', '*', '/'), то программа должна
сообщать ему об ошибке и снова запрашивать знак операции.
Также сообщать пользователю о невозможности деления на ноль,
если он ввел 0 в качестве делителя.
Подсказка:
Вариант исполнения:
- условие рекурсивного вызова - введена операция +, -, *, / - ШАГ РЕКУРСИИ
- условие завершения рекурсии - введена операция 0 - БАЗОВЫЙ СЛУЧАЙ
Решите через рекурсию. В задании нельзя применять циклы.
Пример:
Введите операцию (+, -, *, / или 0 для выхода): +
Введите первое число: 214
Введите второе число: 234
Ваш результат 448
Введите операцию (+, -, *, / или 0 для выхода): -
Введите первое число: вп
Вы вместо трехзначного числа ввели строку (((. Исправьтесь
Введите операцию (+, -, *, / или 0 для выхода):
"""


def recursion():

    operator = input('Введите операцию (+, -, *, / или 0 для выхода):_')

    operator_list = ['+', '-', '*', '/', '0']

    if operator == '0':  # базовый случай
        print('ВЫХОД')

    elif operator not in operator_list:
        print('Вы ввели неверную операцию')
        return recursion()

    else:
        try:
            num_1 = float(input('Введите первое число: '))

        except ValueError:
            print('Вы ввели не число')
            return recursion()

        try:
            num_2 = float(input('Введите второе число: '))

        except ValueError:
            print('Вы ввели не число')
            return recursion()

        if operator == operator_list[0]:
            print(f'{num_1}+{num_2}={num_1+num_2}')
            return recursion()

        if operator == operator_list[1]:
            print(f'{num_1}-{num_2}={num_1-num_2}')
            return recursion()

        if operator == operator_list[2]:
            print(f'{num_1}*{num_2}={num_1*num_2}')
            return recursion()

        if operator == operator_list[3] :
            if num_2 != 0:
                print(f'{num_1}/{num_2}={num_1/num_2}')
                return recursion()
            else:
                print('Деление на ноль невозможно')
                return recursion()


recursion()

