"""
Задание 7.	Напишите программу, доказывающую или проверяющую, что для множества
натуральных чисел выполняется равенство: 1+2+...+n = n(n+1)/2,
где n - любое натуральное число.
Пример:
для n = 5
1+2+3+4+5 = 5(5+1)/2
Нужно написать рекурсивную ф-цию только для левой части выражения!
Результат нужно сверить с правой частью.
Правой части выражения в рекурсивной ф-ции быть не должно!
Решите через рекурсию. В задании нельзя применять циклы.
"""

def series_recursion(num: int):
    if num <= 0:
        print('Число должно быть натуральным!')
        return None
    else:
        if num == 1:
            return 1
        else:
            return series_recursion(num-1) + num

num = 3
if series_recursion(num) == num*(num+1)/2:
    print(f'Для числа {num} выполняется равенство:\n'
          f'{series_recursion(num)} = {num}*({num}+1)/2')
else:
    print('Равенство не выполняется, т.к введено не натуральное число')

