"""
Задание 4.	Найти сумму n элементов следующего ряда чисел:
1 -0.5 0.25 -0.125 ...
Количество элементов (n) вводится с клавиатуры.
Пример:
Введите количество элементов: 3
Количество элементов - 3, их сумма - 0.75
Решите через рекурсию. В задании нельзя применять циклы.
Нужно обойтисть без создания массива!
"""


def recursion(n: int, first_num=1.0, summ=0.0, count=0):

    if n <= 0:
        print('Количество чисел ряда должно быть больше нуля!')
        return recursion(int(input('Введите количество чисел ряда: ')))
    if count == n:
        print(f'Сумма чисел ряда = {summ}')
    else:
        return recursion(n, first_num / (-2), summ + first_num, count + 1)


recursion(0)  # проверка
"""
Количество чисел ряда должно быть больше нуля!
Введите количество чисел ряда: 3
Сумма чисел ряда = 0.75
"""

