"""
Задание 3.
Определить количество различных (уникальных) подстрок
с использованием хеш-функции
Дана строка S длиной N, состоящая только из строчных латинских букв
Подсказка: вы должны в цикле для каждой подстроки вычислить хеш
Все хеши записываем во множество.
Оно отсечет дубли.
Экономия на размере хранимых данных (для длинных строк) и
скорость доступа вместе с уникальностью элементов,
которые даёт множество, сделают решение коротким и эффективным.
Пример:
рара - 6 уникальных подстрок
рар
ра
ар
ара
р
а
"""

new_string = 'nazazanarere'


def unique_in_string(s: str, new_set = set()):
    if len(s) > 1:
        new_set.add(hash(s[:-1]))
        new_set.add(hash(s[1:]))
        return unique_in_string(s[:-1], new_set)
    else:
        return f'содержит {len(new_set)} уникальных подстрок'


print(f'{new_string} {unique_in_string(new_string)}')

#  nazazanarere содержит 22 уникальных подстрок


