"""
Задание 1.
Вам нужно взять 5 любых скриптов, написанных ВАМИ в рамках работы над ДЗ
курсов Алгоритмы и Основы Python
На каждый скрипт нужно два решения - исходное и оптимизированное.
Вы берете исходное, пишете что это за задание и с какого оно курса.
Далее выполняете профилирование скрипта средствами memory_profiler
Вы оптимизируете исходное решение.
Далее выполняете профилирование скрипта средствами memory_profiler
Вам нужно написать аналитику, что вы сделали для оптимизации памяти и
чего добились.
ВНИМАНИЕ:
1) скрипты для оптимизации нужно брать только из сделанных вами ДЗ
курсов Алгоритмы и Основы
2) нельзя дублировать, коды, показанные на уроке
3) для каждого из 5 скриптов у вас отдельный файл, в нем должна быть версия до
и версия после оптимизации
4) желательно выбрать те скрипты, где есть что оптимизировать и не брать те,
где с памятью и так все в порядке
5) не нужно писать преподавателю '''я не могу найти что оптимизировать''', это
отговорки. Примеров оптимизации мы перечислили много: переход с массивов на
генераторы, numpy, использование слотов, применение del, сериализация и т.д.
"""

# Основы. 5 урок. Задание 5.

from memory_profiler import memory_usage, profile
from itertools import islice


def decor_memory(func):
    def wrapper(*args):
        m1 = memory_usage()
        func(*args)
        m2 = memory_usage()
        print(f'memory - {m2[0] - m1[0]}')
    return wrapper


lst = [1, 2, 4, 5, 6, 2, 5, 2]
# До оптимизации

@decor_memory
def uniq(some_list):
    unique_list = [i for i in some_list if some_list.count(i) == 1]
    print(unique_list)


uniq(lst)

# После оптимизации


@decor_memory
def uniq_gen(some_lst):
    unique_list_gen = (i for i in some_lst if some_lst.count(i) == 1)
    print([*islice(unique_list_gen, len(some_lst))])


uniq_gen(lst)



"""
Занимаемая память - 0.01171875 при использовании спискового включения
Занимаемая память - 0.00015456 при использовании генератора

Согласно замерам при переходе от обычного спискового включения к генератору
объем занимаемой памяти уменьшился в 76 раз 
"""

